# created by am_dq_fan #theri  from. Asuran

import asyncio
import random

from userbot.utils import admin_cmd


@bot.on(admin_cmd(pattern=r"lolan", outgoing=True))
async def _(event):
    if event.fwd_from:
        return
    await event.edit("നിന്റെ തന്തഞാനാടാ ....")
    await asyncio.sleep(2)
    x = random.randrange(1, 24)
    if x == 1:
        await event.edit(
            "pha.... മരണ കിടക്കയില്മരിച്ചു കിടന്നമലർന്ന് കിടന്നമല പോലെയുള്ള മലം തിന്ന് ഉണ്ടായ മല മൈരേപരവെടിക്ക് ഊരാകുടുക്കുപോലെപണ്ടാരം അടങ്ങിയ കൊച്ചു ഗോളംപതിനാലാം രാവിൽ പതിനാല് തവണ പലവട്ടം പലവിധം ഊക്കിവിട്ട നിന്റെ അമ്മ മോൾക്അപനെന്ന കുണ്ടൻഅപ്പൂപ്പൻ എന്ന മണ്ടൻപെങ്ങൾ എന്ന പൂറി മോൾഅമ്മുമ്മ കിടന്ന് ഉണ്ടാക്കിയ നിന്റെഅനിയൻതാളം നോക്കാതെ പാടി ഉല്ലസിക്കാം 😚🕺🕺"
        )
    if x == 2:
        await event.edit(
            "അതിന് നിന്റെ അമ്മക് ഏതു യോനിയ ഉള്ളത്അത് അല്ലെകഴിഞ്ഞവീക്കിൽഉത്സവകമ്മറ്റിക്കാർക്കപൈസകൊടുക്കാൻ അല്ലാതെ ആയപ്പോഅവര്ക് വേണ്ടി സാരി പൊക്കികുനിഞ്ഞു നിന്ന് യോനി നാട്ടിൽ ഉള്ളോർക് കാണിച്ചു കിട്ടിയ പൈസ നിന്റെ അപ്പൻ കുണ്ടൻനിന്റെ അപ്പുപ്പനെ ഊക്കിയത്"
        )
    if x == 3:
        await event.edit(
            "നിന്റെ തീട്ട കൂതി തുറന്നു വെക്കോ പന്നി പടക്കം വെച്ചു നിന്റെ തന്ത ടെ ഉണങ്ങിയ കുണ്ണ അതിൽ കേറ്റി വെച്ചു സിമന്റു വെച്ചു അടച്ചും പന്നി പടക്കത്തിന്റെ തിരി പുറത്തേക്കു നീട്ടി തീ കൊളുത്തി തീട്ട് കൂതി പൊട്ടിത്തെറി നിന്റെ തള്ള വന്നു നക്കി നിന്റെ തീട്ട കൂതിയും അപ്പന്റെ അണ്ടിയും😆😆😆"
        )
    if x == 4:
        await event.edit(
            "നിന്റെ തള്ള ഏതാടാ പൂറി അവളെ ഞങ്ങൾ ബലാത്സംഗം ചെയ്തപ്പോൾ പോലും അവൾ ഇങ്ങനെ ഒന്നും പറഞ്ഞിട്ടില്ലല്ലോ... നീ അവൾക്ക് ഉണ്ടായതന്നെ ആണോ"
        )
    if x == 5:
        await event.edit("പോ തായോളി നിന്റെ തള്ളയുടെ അണ്ണാക്കിൽ തൂറി വാടാ 😃😃😃😃😃😃😂🤣")
    if x == 6:
        await event.edit(
            "നിന്റെ തള്ള എന്ന് പറയുന്നു അ കാട്ടു വേശി. പറ വേശി പടു വേശി കണ്ട പൊട്ടൻ മാര് വന്ന് മാറി തിരിഞ്ഞു പണ്ണി ഓത്തു പിഴച്ചു ഉണ്ടായ മോൻ അല്ലെ നീ തായോളി തള്ളേ ഓളി😂"
        )
    if x == 7:
        await event.edit(
            "കള്ള അവരാതി ക്ക് ഉണ്ടായ പന്ന പൂറി മോനെനി ഏത് ഊമ്പി തെറി പറഞ്ഞാലും തീട്ടം ഉള്ള നിന്റെ കുണ്ട നിന്റർ തള്ള മത്തിഇനി വീട്ടിൽ പെങ്ങൾ പൂറി ഉണ്ടേൽ അവൾക്കും ഇത് അയക്കോ മൈരേ നിപരവെടി തള്ള ക്ക് ഉണ്ടായ അറവാണിച്ചു എംപൂറി മോനെതന്ത കുണ്ടൻ പണി എടുത്തു നിന്നെ ഉണ്ടാക്കിഅത്ര കാഴ്‌പ്പ് ആണ് നിന്റെ തളളക്ക്.ഇന്നലെ തള്ളയും പെങ്ങളും കവച്ചു കിടകയിരുന്നു4 ചാവലി പട്ടിയുടെ കുണ്ണ ക്ക് വെണ്ടി അത് 2 കൂടി ചപ്പി പട്ടിയുടെ തീട്ടം മുഴുവൻ തിന്ന് ആണ് പോയത്തന്ത മാറി കുണ്ടൻ അടിക്കുന്ന നിന്റർ ഓട്ടയിൽമൈര് പൂറി മോനെഎവിടാ പട്ടി ക്ക് ഉണ്ടായ കുണ്ട നി ഊംബി പോയോ തനത് ടെ കുണ്ണ"
        )
    if x == 8:
        await event.edit("പോ തായോളി നിന്റെ തള്ളയുടെ അണ്ണാക്കിൽ തൂറി വാടാ 😃😃😃😃😃😃😂🤣....")
    if x == 9:
        await event.edit(
            "നേരത്തിന് അന്നം കഴിക്കണംഅല്ലതെ പട്ടി തീട്ടം തന്നിട്ട് കാര്യമില്ല😂😂"
        )
    if x == 10:
        await event.edit(
            "നിനക്കു ഭാഗ്യം ഉണ്ട്കുറെ കാലയി ഇങ്ങനെ തെറി വിളിച്ചിട്ട്അതിന് അവസരം തന്ന നിന്റെ കുഞ്ഞി പെങ്ങളെ സ്മരിക്കുന്ന്(ലോല മാണ്ട) നമ്മൾക് അവന്റെ അമ്മുമ്മനെ പണിയ ബാ പോവാം😂അതിന് ലോല അവന്റെ അപ്പുപ്പൻ ??"
        )
    if x == 11:
        await event.edit("നിന്റെ തള്ളേടെ കൂതി മൈരേ")
    if x == 12:
        await event.edit("ആളും തരവും നോക്കി കളിക്കടാ പട്ടി ഓത്ത മൈരേ...")
    if x == 13:
        await event.edit(
            "വവ്വാലിൻ കാട്ടം പൂറ്റിൽ വീണു മുളച്ച് ഉണ്ടായതോണോ വെടലകൂതി പുണ്ടച്ചി മോനെ നീ...."
        )
    if x == 14:
        await event.edit(
            "നിന്റെ അപ്പൂപ്പനെ ഞങ്ങൾ വിറ്റ്പൈസ നിന്റെ കുഞ്ഞി പെങ്ങളെ യോനിയിൽ കയറ്റി വെച്ചിട്ടുണ്ട്അത് വേണേൽ ഒരു പൈസ കുടുക്ക ആയി use ചെയ്തോ😂😂...."
        )
    if x == 15:
        await event.edit(
            "മുത്തുമോൾക് മുത്തു മാലയിൽമുത്തു കോർത്തു മാല ഉണ്ടാക്കാൻ അറിയോഅത് പോലെ നിന്റെ ലിംഗത്തിൽ താഴെയുള്ള ബോൾസ് ഇല്ലേ(💐 അല്ല ഇവൻ ആഹ് പറഞ്ഞ ലിംഗം ഉണ്ടോ)നി ഒന്ന് കാണിച്ചു താനോക്കട്ടെലിംഗം ആണോ യോനി ആണോ എന്ന്😂😂അത് നിന്റെ അപ്പുപ്പൻ കുണ്ടൻ അയച്ചു കൊടുത്തു കുറച്ചു പൈസ ഉണ്ടാക്കണം എന്നിട് നിന്റെ അമ്മക്ക് വായു ഗുളിക മേടിച്ചു കൊടുക്കണം😁😁.."
        )
    if x == 16:
        await event.edit(
            "കള്ള അവരാതി ക്ക് ഉണ്ടായ പന്ന പൂറി മോനെനി ഏത് ഊമ്പി തെറി പറഞ്ഞാലും തീട്ടം ഉള്ള നിന്റെ കുണ്ട നിന്റർ തള്ള മത്തിഇനി വീട്ടിൽ പെങ്ങൾ പൂറി ഉണ്ടേൽ അവൾക്കും ഇത് അയക്കോ മൈരേ നിപരവെടി തള്ള ക്ക് ഉണ്ടായ അറവാണിച്ചു എംപൂറി മോനെ.തന്ത കുണ്ടൻ പണി എടുത്തു നിന്നെ ഉണ്ടാക്കിഅത്ര കാഴ്‌പ്പ് ആണ് നിന്റെ തളളക്ക്.ഇന്നലെ തള്ളയും പെങ്ങളും കവച്ചു കിടകയിരുന്നു4 ചാവലി പട്ടിയുടെ കുണ്ണ ക്ക് വെണ്ടി അത് 2 കൂടി ചപ്പി പട്ടിയുടെ തീട്ടം മുഴുവൻ തിന്ന് ആണ് പോയത്തന്ത മാറി കുണ്ടൻ അടിക്കുന്ന നിന്റർ ഓട്ടയിൽമൈര് പൂറി മോനെഎവിടാ പട്ടി ക്ക് ഉണ്ടായ കുണ്ട നി ഊംബി പോയോ തനത് ടെ കുണ്ണ"
        )
    if x == 17:
        await event.edit(
            "അതെന്നെ നിന്നെ പുലയിൽ ഇട്ട്ആട്ടിയാണ് നിന്നെ ഉണ്ടാക്കിയത് ശെടാ മൈര് ഊമ്പിനി ഉണ്ടായത് കാക്ക കഷ്ടത്തിലെ ലൂസ് ആയി പോയ വെളുത്ത കഷ്ടം ഒലിച്ചു ഇറങ്ങിയപ്പോപരിണാമം സംഭവിച്ചത് അല്ലെ കുണ്ടൻ അടിച്ചു അപ്പുപ്പൻ ഉണ്ടാക്കിയ നിന്റെ അപ്പൻ എന്ന്വിളിക്കുന്ന മരവാഴ🌚🌚..... "
        )
    if x == 18:
        await event.edit(
            "പ്രസവിക്കുമ്പോ തള്ളേടെ പൂറ്റിൽ വത്സനടിച്ച നിനക്ക് ഒക്കെ പട്ടിടെ വിലയുണ്ടോ മുറി അണ്ടി പൂറാ...."
        )
    if x == 19:
        await event.edit(
            "നിന്നെ ഉണ്ടാക്കാൻ നിന്റെ അപ്പന്റെ അണ്ടിക്ക് ബലം ഇല്ലാഞ്ഞിട്ട് ഞാൻ ആട നിന്റെ  അമ്മയെ പണിഞ്ഞെ 🤣🤣"
        )
    if x == 20:
        await event.edit(
            "നിന്റെ തന്തക്കു വെപ്പണ്ടി അല്ലെ പിന്നെ നിന്നെ പറഞ്ഞിട്ട് കാര്യം ഇല്ല തന്തക് അണ്ടി ഇല്ലല്ലോ 😆😆.."
        )
    if x == 21:
        await event.edit(
            "നിനക്ക് ഒകെ ചാണകത്തിൽ വെളിച്ചെണ്ണ ഒഴിച്ച് തന്നുടെ പൊലയാടി മോനെ . "
        )
    if x == 22:
        await event.edit(
            "നിന്റെ അണ്ടിക്ക് ബലം  ഉണ്ടേൽ വീട്ടിലെ അമ്മയെ കേറ്റി കളിക്ക് ഇല്ലെങ്കിൽ നിന്റെ അമ്മ  ബങ്കാളികൾക്ക്  പൂർ സ്ഥിരം ആയി കൊടുക്കേണ്ടി വരും  ...."
        )
    if x == 23:
        await event.edit("കഴപ്പ് മാറിയിലെ പശുവിന്റെ കുതിയിൽ അടിക്ക് മൈരേ ")
    if x == 24:
        await event.edit("നിന്റെ തള്ളേടെ കരിംപൂർ ഊംബികോ മൈരേ ")
